Revit 2026 API

# LightShape Properties

---

The LightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

LightShape Class

Autodesk.Revit.DB.Lighting Namespace